avr-rust/avrd/packs/atmega/ATmega32M1.atdf
        <register caption="PSC Module 0 Input Control Register" name="PMIC0" offset="0xB8" size="1" ocd-rw="">
          <bitfield caption="PSC Module 0 Overlap Enable" mask="0x80" name="POVEN0"/>
          <bitfield caption="PSC Module 0 Input Select" mask="0x40" name="PISEL0"/>
          <bitfield caption="PSC Module 0 Input Level Selector" mask="0x20" name="PELEV0"/>
          <bitfield caption="PSC Module 0 Input Filter Enable" mask="0x10" name="PFLTE0"/>
          <bitfield caption="PSC Module 0 Asynchronous Output Control" mask="0x08" name="PAOC0"/>
          <bitfield caption="PSC Module 0 Input Mode bits" mask="0x07" name="PRFM0"/>
        </register>
        <register caption="PSC Control Register" name="PCTL" offset="0xB7" size="1" ocd-rw="">
          <bitfield caption="PSC Prescaler Select bits" mask="0xC0" name="PPRE"/>
          <bitfield caption="PSC Input Clock Select" mask="0x20" name="PCLKSEL"/>
          <bitfield caption="PSC Complete Cycle" mask="0x02" name="PCCYC"/>
          <bitfield caption="PSC Run" mask="0x01" name="PRUN"/>
        </register>
        <register caption="PSC Output Configuration" name="POC" offset="0xB6" size="1" ocd-rw="">
          <bitfield caption="PSC Output 2B Enable" mask="0x20" name="POEN2B"/>
          <bitfield caption="PSC Output 2A Enable" mask="0x10" name="POEN2A"/>
          <bitfield caption="PSC Output 1B Enable" mask="0x08" name="POEN1B"/>
          <bitfield caption="PSC Output 1A Enable" mask="0x04" name="POEN1A"/>
          <bitfield caption="PSC Output 0B Enable" mask="0x02" name="POEN0B"/>
          <bitfield caption="PSC Output 0A Enable" mask="0x01" name="POEN0A"/>
        </register>
        <register caption="PSC Configuration Register" name="PCNF" offset="0xB5" size="1" ocd-rw="">
          <bitfield caption="PSC Update Lock" mask="0x20" name="PULOCK"/>
          <bitfield caption="PSC Mode" mask="0x10" name="PMODE"/>
          <bitfield caption="PSC Output B Polarity" mask="0x08" name="POPB"/>
          <bitfield caption="PSC Output A Polarity" mask="0x04" name="POPA"/>
        </register>
        <register caption="PSC Synchro Configuration" name="PSYNC" offset="0xB4" size="1" ocd-rw="">
          <bitfield caption="Selection of Synchronization Out for ADC" mask="0x30" name="PSYNC2"/>
          <bitfield caption="Selection of Synchronization Out for ADC" mask="0x0C" name="PSYNC1"/>
          <bitfield caption="Selection of Synchronization Out for ADC" mask="0x03" name="PSYNC0"/>
        </register>
        <register caption="PSC Output Compare RB Register " name="POCR_RB" offset="0xB2" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 2 Output Compare SB Register " name="POCR2SB" offset="0xB0" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 2 Output Compare RA Register " name="POCR2RA" offset="0xAE" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 2 Output Compare SA Register " name="POCR2SA" offset="0xAC" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 1 Output Compare SB Register " name="POCR1SB" offset="0xAA" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 1 Output Compare RA Register " name="POCR1RA" offset="0xA8" size="2" mask="0x0FFF"/>
        <register caption="PSC Output Compare SA Register " name="POCR1SA" offset="0xA6" size="2" mask="0x0FFF"/>
        <register caption="PSC Output Compare SB Register " name="POCR0SB" offset="0xA4" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 0 Output Compare RA Register " name="POCR0RA" offset="0xA2" size="2" mask="0x0FFF"/>
        <register caption="PSC Module 0 Output Compare SA Register " name="POCR0SA" offset="0xA0" size="2" mask="0x0FFF"/>
      </register-group>
    </module>
  </modules>
</avr-tools-device-file>
